app/views/infoplants/index.html.erb

        <%= label_tag :typology, 'Tipo' %>
        <%= select_tag :typology, options_for_select(Plant.pluck(:typology).uniq, params[:typology]), include_blank: true %>
---
SELECT "plants"."typology" FROM "plants"

        <%= label_tag :climate, 'Clima' %>
        <%= select_tag :climate, options_for_select(Plant.pluck(:climate).uniq, params[:climate]), include_blank: true %>
---
SELECT "plants"."climate" FROM "plants"

        <%= label_tag :use, 'Uso' %>
        <%= select_tag :use, options_for_select(Plant.pluck(:use).uniq, params[:use]), include_blank: true %>
---
SELECT "plants"."use" FROM "plants"


<div class="plants-grid <%= 'single-item' if @plants.size == 1 %>">
---
SELECT "plants".* FROM "plants" WHERE (light LIKE '%2%') AND (LOWER(use) LIKE '%decorativa%')
SELECT COUNT(*) FROM "plants" WHERE (LOWER(typology) LIKE '%acquatica%') AND (LOWER(climate) LIKE '%arido%') AND (light LIKE '%3%') AND (irrigation LIKE '%1%') AND (LOWER(use) LIKE '%culinario%') AND (size LIKE '%2%')