app/views/users/profile.html.erb

    </div>
    <div class="plants-grid <%= 'single-item' if @myplants.size == 1 %>">
---
SELECT COUNT(*) FROM "plants" WHERE 1=0