app/views/nursery_profile/profile.html.erb

                  <% email_counts = Hash.new(0) %>
                  <% @reservations[plant.nursery_plant_id].each do |email, _| %>
---
SELECT "nursery_plants"."id" FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ?  [["nursery_id", 1]]