app/views/nurseries/index.html.erb

SELECT "nurseries".* FROM "nurseries"
SELECT COUNT(*) FROM "nurseries"
---
  <% else %>
    <div class="nurseries-container <%= 'single-item' if @nurseries.size == 1 %>">