app/views/nurseries/show.html.erb

  <!-- Sezione Piante Disponibili -->
  <% if @nursery.nursery_plants.any? %>
---
SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ?  [["nursery_id", 1]]
SELECT 1 AS one FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ? LIMIT ?  [["nursery_id", 5], ["LIMIT", 1]]

      <div class="nursery-plants-container">
        <% @nursery.nursery_plants.each do |nursery_plant| %>
---
SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ?  [["nursery_id", 1]]