app/controllers/infoplants_controller.rb

SELECT "plants".* FROM "plants" WHERE (LOWER(typology) LIKE '%acquatica%') AND (LOWER(climate) LIKE '%temperato%') AND (LOWER(use) LIKE '%decorativa%') AND (size LIKE '%3%')
SELECT COUNT(*) FROM "plants" WHERE (LOWER(typology) LIKE '%acquatica%') AND (LOWER(climate) LIKE '%arido%') AND (light LIKE '%3%') AND (irrigation LIKE '%1%') AND (LOWER(use) LIKE '%culinario%') AND (size LIKE '%2%')
SELECT "myplants"."plant_id" FROM "myplants" WHERE "myplants"."user_id" = ?  [["user_id", 3]]
---
  def index
    @nrs_users = User.where(nursery: 1)
    @std_users = User.where(nursery: 0)

    @plants = Plant.search(
      query: params[:query],
      typology: params[:typology],
      climate: params[:climate],
      light: params[:light],
      irrigation: params[:irrigation],
      use: params[:use],
      size: params[:size]
    ) || []

    if current_user
      @user_plants = Myplant.where(user_id: current_user.id).pluck(:plant_id)

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def show
    @plant = Plant.find(params[:id])