app/controllers/infoplants_controller.rb

SELECT "infoplants".* FROM "infoplants"
---
  def index
    #@infoplants = params[:query].present? ? Infoplant.search(params[:query]) : Infoplant.all
    @infoplants = Infoplant.search(
      query: params[:query],
      typology: params[:typology],
      climate: params[:climate],
      light: params[:light],
      irrigation: params[:irrigation],
      use: params[:use],
      size: params[:size]
    )|| []

SELECT "infoplants".* FROM "infoplants" WHERE "infoplants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @infoplant = Infoplant.find(params[:id])