app/controllers/myplants_controller.rb

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "myplants".* FROM "myplants" WHERE "myplants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @myplant = Myplant.find(params[:id])

INSERT INTO "myplants" ("plant_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["plant_id", 3], ["user_id", 3], ["created_at", "2024-08-10 09:06:02.998640"], ["updated_at", "2024-08-10 09:06:02.998640"]]
---
  def addmyplant
    myplant = Myplant.new(plant_id: params[:myplant_id], user_id: current_user.id)
    if myplant.save

SELECT "myplants".* FROM "myplants" WHERE "myplants"."plant_id" = ? AND "myplants"."user_id" = ? LIMIT ?  [["plant_id", 4], ["user_id", 11], ["LIMIT", 1]]
DELETE FROM "myplants" WHERE "myplants"."id" = ?  [["id", 46]]
---
  def removemyplant
    myplant = Myplant.find_by(plant_id: params[:plant_id], user_id: current_user.id)
    if myplant && myplant.destroy