app/controllers/myplants_controller.rb

SELECT "myplants".* FROM "myplants" WHERE "myplants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def addmyplant
    myplant = Myplant.find_by(id: params[:myplant_id])