app/controllers/nurseries_controller.rb

SELECT "nurseries".* FROM "nurseries" ORDER BY "position" ASC
SELECT "nurseries".* FROM "nurseries" WHERE (LOWER(name) LIKE '%vivaio verde%' OR LOWER(location) LIKE '%vivaio verde%' OR LOWER(description) LIKE '%vivaio verde%')
SELECT MAX("nurseries"."id") FROM "nurseries"
---
  def index
    @nurseries = params[:query].present? ? Nursery.search(params[:query]) : Nursery.order(:position)
    @max_id = Nursery.maximum(:id)

SELECT "nurseries".* FROM "nurseries" WHERE "nurseries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @nursery = Nursery.find(params[:id])

SELECT 1 AS one FROM "nurseries" WHERE "nurseries"."number" = ? LIMIT ?  [["number", 1234567890], ["LIMIT", 1]]
---
  def create
    @nursery = Nursery.new(nursery_params)
    @nursery.id_owner = current_user.id  # Associa il vivaio all'utente corrente

    # Converti il numero di telefono in stringa
    number_str = @nursery.number.to_s

    # Controlla il numero di telefono
    if number_str.blank? || number_str.length != 10
      @nursery.errors.add(:number, "Il numero di telefono inserito non è valido. Deve essere di 10 cifre.")
      @nursery.number = ''  # Svuota il campo numero
    elsif Nursery.exists?(number: number_str)