app/controllers/nursery_plants_controller.rb

SELECT "nurseries".* FROM "nurseries" WHERE "nurseries"."id_owner" = ? LIMIT ?  [["id_owner", 3], ["LIMIT", 1]]
SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ? AND "nursery_plants"."plant_id" = ? LIMIT ?  [["nursery_id", 1], ["plant_id", 3], ["LIMIT", 1]]
UPDATE "nursery_plants" SET "num_reservations" = ?, "updated_at" = ? WHERE "nursery_plants"."id" = ?  [["num_reservations", 1], ["updated_at", "2024-08-06 09:27:13.785331"], ["id", 1]]
INSERT INTO "nursery_plants" ("nursery_id", "plant_id", "max_disponibility", "num_reservations", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nursery_id", 1], ["plant_id", 3], ["max_disponibility", 1], ["num_reservations", 0], ["created_at", "2024-08-09 17:13:39.684759"], ["updated_at", "2024-08-09 17:13:39.684759"]]
---
  def add_to_nursery
    nursery = Nursery.find_by(id_owner: current_user.id)

    if nursery.nil?
      render json: { success: false, message: "Nessun vivaio trovato per l'utente corrente." }, status: :unprocessable_entity
      return
    end

    existing_nursery_plant = NurseryPlant.find_by(nursery_id: nursery.id, plant_id: params[:plant_id])
    if existing_nursery_plant
      render json: { success: false, message: "La pianta è già presente nel vivaio." }, status: :unprocessable_entity
      return
    end

    nursery_plant = NurseryPlant.new(
      nursery_id: nursery.id,
      plant_id: params[:plant_id],
      max_disponibility: 1,
      num_reservations: 0
    )

    if nursery_plant.save

SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ? AND "nursery_plants"."plant_id" = ? LIMIT ?  [["nursery_id", 1], ["plant_id", 4], ["LIMIT", 1]]
UPDATE "nursery_plants" SET "max_disponibility" = COALESCE("max_disponibility", 0) + ? WHERE "nursery_plants"."id" = ?  [["max_disponibility", 1], ["id", 55]]
---
  def incdisp
    nursery_plant = NurseryPlant.find_by(nursery_id: params[:nursery_id], plant_id: params[:plant_id])
    if nursery_plant
      nursery_plant.increment!(:max_disponibility)

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
UPDATE "nursery_plants" SET "num_reservations" = ?, "updated_at" = ? WHERE "nursery_plants"."id" = ?  [["num_reservations", 1], ["updated_at", "2024-08-10 09:31:04.933445"], ["id", 55]]
INSERT INTO "reservations" ("nursery_plant_id", "user_email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nursery_plant_id", 55], ["user_email", "andrea.folino@gmail.com"], ["created_at", "2024-08-10 09:31:04.962442"], ["updated_at", "2024-08-10 09:31:04.962442"]]
---
  def reserve
    nursery_plant = NurseryPlant.find_by(id: params[:nursery_plant_id])
    if nursery_plant.max_disponibility - nursery_plant.num_reservations > 0
      nursery_plant.num_reservations += 1
      if nursery_plant.save
        Reservation.create(nursery_plant_id: nursery_plant.id, user_email: current_user.email)

SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ? AND "nursery_plants"."plant_id" = ? LIMIT ?  [["nursery_id", 1], ["plant_id", 3], ["LIMIT", 1]]
UPDATE "nursery_plants" SET "max_disponibility" = COALESCE("max_disponibility", 0) - ? WHERE "nursery_plants"."id" = ?  [["max_disponibility", 1], ["id", 58]]
---
  def decdisp
    nursery_plant = NurseryPlant.find_by(nursery_id: params[:nursery_id], plant_id: params[:plant_id])
    if nursery_plant
      if nursery_plant.max_disponibility - nursery_plant.num_reservations > 0
        nursery_plant.decrement!(:max_disponibility)

SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."plant_id" = ? AND "nursery_plants"."nursery_id" = ? LIMIT ?  [["plant_id", 8], ["nursery_id", 1], ["LIMIT", 1]]
DELETE FROM "nursery_plants" WHERE "nursery_plants"."id" = ?  [["id", 56]]
---
  def removenursplant
    plant = NurseryPlant.find_by(plant_id: params[:plant_id], nursery_id: params[:nursery_id])
    if plant
      if plant.num_reservations<=0
        if plant.destroy