app/controllers/nursery_plants_controller.rb

  def reserve
    nursery_plant = NurseryPlant.find(params[:nursery_plant_id])

    if nursery_plant.max_disponibility - nursery_plant.num_reservations > 0
      nursery_plant.num_reservations += 1

      if nursery_plant.save
        Reservation.create(nursery_plant_id: nursery_plant.id, user_email: current_user.email)
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "nursery_plants".* FROM "nursery_plants" WHERE "nursery_plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "nursery_plants" SET "num_reservations" = ?, "updated_at" = ? WHERE "nursery_plants"."id" = ?  [["num_reservations", 1], ["updated_at", "2024-08-06 08:17:53.745739"], ["id", 1]]
INSERT INTO "reservations" ("nursery_plant_id", "user_email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nursery_plant_id", 1], ["user_email", "mrossi@gmail.com"], ["created_at", "2024-08-06 09:27:13.839309"], ["updated_at", "2024-08-06 09:27:13.839309"]]