app/controllers/nursery_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(session[:user_id])