app/controllers/nursery_profile_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @nursery = User.find(params[:id])

SELECT "nursery_plants"."id" FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ?  [["nursery_id", 1]]
---
  def satisfy_order
    plant_id = params[:plant_id]
    user_email = params[:email]

    reservations = Reservation.where(nursery_plant_id: plant_id, user_email: user_email)

    if reservations.any?
      num_reservations_to_remove = reservations.count

      nursery_plant = NurseryPlant.find_by(id: plant_id)

SELECT "nurseries".* FROM "nurseries" WHERE "nurseries"."id_owner" = ? LIMIT ?  [["id_owner", 3], ["LIMIT", 1]]
SELECT "nursery_plants"."id" FROM "nursery_plants" WHERE "nursery_plants"."nursery_id" = ?  [["nursery_id", 1]]
SELECT COUNT(*) FROM "nursery_plants" INNER JOIN "plants" ON "plants"."id" = "nursery_plants"."plant_id" WHERE "nursery_plants"."nursery_id" = ?  [["nursery_id", 3]]
---
  def profile
    @nursery = Nursery.find_by(id_owner: current_user.id)
    nursery_ids = Nursery.where(id_owner: current_user.id).pluck(:id)
    nursery_plant_ids = NurseryPlant.where(nursery_id: nursery_ids).pluck(:id)

    @myplants = Plant.joins(:nursery_plants)
                     .where(nursery_plants: { id: nursery_plant_ids })
                     .select('plants.id, plants.name, nursery_plants.id as nursery_plant_id, nursery_plants.max_disponibility as disp, nursery_plants.num_reservations as res,
                              typology, light, size, irrigation, use, climate, irrigation, description')