app/controllers/plants_controller.rb

  def create
    @plant = Plant.new(plant_params)

    respond_to do |format|
      if @plant.save
---
INSERT INTO "plants" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "yyof"], ["description", "oihpg"], ["created_at", "2024-07-30 07:25:07.542289"], ["updated_at", "2024-07-30 07:25:07.542289"]]

    def set_plant
      @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]