app/controllers/registrations_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "marcovivaio@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.new(user_params)

    # Esegui il controllo del nome
    if @user.nome.blank?
      @user.errors.add(:nome, "Per proseguire è necessario inserire il nome")
      @user.nome = ''  # Svuota il campo nome
    end

    # Esegui il controllo del cognome
    if @user.cognome.blank?
      @user.errors.add(:cognome, "Per proseguire è necessario inserire il cognome")
      @user.cognome = ''  # Svuota il campo cognome
    end

    if User.exists?(email: @user.email)