app/controllers/registrations_controller.rb

  def verify_otp
    @user_data = session[:otp_user_data]
    puts session[:otp_nursery_data]

    return redirect_to new_user_registration_path, alert: "Sessione scaduta o utente non trovato." unless @user_data

    # Recupera il secret e l'OTP dalla sessione
    otp_secret = session[:otp_secret]
    otp_code = session[:otp_code]

    if request.post?
      otp_attempt = params[:otp_attempt].strip

      totp = ROTP::TOTP.new(otp_secret, digits: 8)
      if totp.verify(otp_attempt, drift_behind: 60)

        @user = User.new(@user_data)
        @user.otp_secret = otp_secret  # Imposta il secret sull'utente
        if @user.save(validate: false)  # Salva l'utente
          if @user_data["nursery"]=="true"
            @nursery_data = session[:otp_nursery_data].merge!('id_owner' => @user.id)
            puts "XXXXXXXXXXXXXXXXXXXXXXXXX"
            puts @nursery_data
            @nursery=Nursery.new(@nursery_data)
            @nursery.save()
---
INSERT INTO "users" ("email", "encrypted_password", "nome", "cognome", "address", "created_at", "updated_at", "nursery", "otp_secret", "otp_required_for_login") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "nurseries" ("name", "id_owner", "number", "email", "address", "location", "open_time", "close_time", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)