app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)
    normalize_and_validate_user(@user)
    if @user.errors.any?
      puts "User errors: #{@user.errors.full_messages}"
      render :new
    else
      @user.generate_otp_secret unless @user.otp_secret.present?
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "nome", "cognome", "created_at", "updated_at", "nursery") VALUES (?, ?, ?, ?, ?, ?, ?)

  def verify_otp
    @user = User.find_by(id: session[:otp_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]