app/controllers/reservations_controller.rb

  def set_nursery_plant
    @nursery_plant = NurseryPlant.find(params[:nursery_plant_id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]