app/controllers/users_controller.rb

SELECT "myplants"."plant_id" FROM "myplants" WHERE "myplants"."user_id" = ?  [["user_id", 11]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" IN (?, ?, ?)  [["id", 14], ["id", 34], ["id", 35]]
---
  def profile
    # Recupera le piante dell'utente
    plant_ids = Myplant.where(user_id: current_user.id).pluck(:plant_id)
    @myplants = Plant.where(id: plant_ids)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(id: params[:id]) || current_user